https://realpython.com/pandas-groupby/

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'a' : [ 100,20,30,40,50],'b' : [20,20,15,20,25],'c' : [100000,100,1000,34,45]})
df

     a   b       c
0  100  20  100000
1   20  20     100
2   30  15    1000
3   40  20      34
4   50  25      45

In [9]:
df.add?

In [10]:
df.add(1)

     a   b       c
0  101  21  100001
1   21  21     101
2   31  16    1001
3   41  21      35
4   51  26      46

In [12]:
df.sub(0)

     a   b       c
0  100  20  100000
1   20  20     100
2   30  15    1000
3   40  20      34
4   50  25      45

In [13]:
df

     a   b       c
0  100  20  100000
1   20  20     100
2   30  15    1000
3   40  20      34
4   50  25      45

In [15]:
df - [1,2,3]

    a   b      c
0  99  18  99997
1  19  18     97
2  29  13    997
3  39  18     31
4  49  23     42

In [17]:
print(df.agg)

<bound method DataFrame.aggregate of      a   b       c
0  100  20  100000
1   20  20     100
2   30  15    1000
3   40  20      34
4   50  25      45>

In [18]:
df.aggregate

<bound method DataFrame.aggregate of      a   b       c
0  100  20  100000
1   20  20     100
2   30  15    1000
3   40  20      34
4   50  25      45>

In [19]:
df.append?

In [20]:
df2 = pd.DataFrame({'a':[1,2,3,4,5]})

In [21]:
df2

   a
0  1
1  2
2  3
3  4
4  5

In [22]:
df.append(df2)

C:\Users\saina\Anaconda3\lib\site-packages\pandas\core\frame.py:7138: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort,

     a     b         c
0  100  20.0  100000.0
1   20  20.0     100.0
2   30  15.0    1000.0
3   40  20.0      34.0
4   50  25.0      45.0
0    1   NaN       NaN
1    2   NaN       NaN
2    3   NaN       NaN
3    4   NaN       NaN
4    5   NaN       NaN

In [23]:
df.count

<bound method DataFrame.count of      a   b       c
0  100  20  100000
1   20  20     100
2   30  15    1000
3   40  20      34
4   50  25      45>

In [24]:
df.drop_duplicates

<bound method DataFrame.drop_duplicates of      a   b       c
0  100  20  100000
1   20  20     100
2   30  15    1000
3   40  20      34
4   50  25      45>

In [29]:
df.drop(columns= 'a', axis = 0)

    b       c
0  20  100000
1  20     100
2  15    1000
3  20      34
4  25      45

In [30]:
## now i am going to use with group by

In [32]:
df

     a   b       c
0  100  20  100000
1   20  20     100
2   30  15    1000
3   40  20      34
4   50  25      45

In [36]:
df3 = df.groupby('b')['c'].count()

In [37]:
df3.tail()

b
15    1
20    3
25    1
Name: c, dtype: int64

In [38]:
df.groupby('b')['c'].sum()

b
15      1000
20    100134
25        45
Name: c, dtype: int64

In [47]:
df4 = df.groupby(['b'])['c'].sum()

In [48]:
df4.head()

b
15      1000
20    100134
25        45
Name: c, dtype: int64

In [49]:
## In this notebook i worked on dataframe methods like add, append, groupby

In [52]:
df.asof?

In [53]:
df.add_prefix?

In [54]:
df.add_suffix?

In [55]:
df.agg?

In [60]:
df.agg('c',axis = 0)

0    100000
1       100
2      1000
3        34
4        45
Name: c, dtype: int64

In [61]:
df.aggregate('b')

0    20
1    20
2    15
3    20
4    25
Name: b, dtype: int64

In [62]:
df

     a   b       c
0  100  20  100000
1   20  20     100
2   30  15    1000
3   40  20      34
4   50  25      45

In [63]:
df.aggregate?

In [73]:
df.agg([sum,min,max])

       a    b       c
sum  240  100  101179
min   20   15      34
max  100   25  100000

In [74]:
df.align?

In [75]:
df.between_time?

In [2]:
df

     a   b       c
0  100  20  100000
1   20  20     100
2   30  15    1000
3   40  20      34
4   50  25      45

In [ ]:
d = df.groupby('b')['c'].count()

In [ ]:
d